In [9]:
#Question 1: What is a database? Differentiate between SQL and NoSQL databases.


#Answer:
#A database is a collection of organized data that is stored and managed on a computer system. It allows for efficient storage, retrieval, and manipulation of large amounts of data. A database system typically consists of software that manages the data, a database server that stores the data, and one or more applications that access the data.

#SQL (Structured Query Language) and NoSQL (Not only SQL) are two different types of database management systems that use different methods for storing and retrieving data. Here are some key differences between the two:

#Feature                        SQL databases                             NoSQL databases

#Data model                    Relational data model                   Flexible data model
#Query language                   SQL                               Database-specific query language
#Scalability                   Vertically scalable                     Horizontally scalable
#Consistency                   Strong consistency                   May offer weaker consistency models
#Usage                        Complex queries and transactions      Fast and flexible data processing

#Here are some examples of each databases:

#1)SQL Databases:
#mySQL
#Oracle
#PostgreSQL
#Microsoft SQL Server
#SQLite

#2)NoSQL Databases:
#MongoDB (document-oriented)
#Cassandra (column-family)
#Redis (key-value)
#Neo4j (graph)
#Amazon DynamoDB (document-oriented)

#It's worth noting that there are many different types of NoSQL databases, each with their own strengths and weaknesses. For example, document-oriented databases like MongoDB are great for storing unstructured data such as JSON documents, while graph databases like Neo4j are ideal for modeling complex relationships between data points.

#Similarly, there are many different types of SQL databases, each with their own features and benefits. For example, MySQL is a popular choice for web applications due to its fast performance and scalability, while PostgreSQL is often used for data warehousing and business intelligence applications due to its advanced query optimization capabilities.

#Ultimately, the choice between SQL and NoSQL databases will depend on the specific requirements of your application and the type of data you need to store and process.

In [10]:
#Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

#Answer : DDL stands for Data Definition Language, which is a subset of SQL used to create, modify, and delete database objects such as tables, indexes, and views.
#Establishing Connection with SQLite3
#Dependencies required : sqlalchemy==1.3.9 , ipython-sql
#Using !pip install to install above package through this jupyter notebook

!pip install sqlalchemy==1.3.9 ipython-sql

Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\ram charan reddy\anaconda3\lib\site-packages (1.3.9)
Requirement already satisfied: ipython-sql in c:\users\ram charan reddy\anaconda3\lib\site-packages (0.4.1)
Requirement already satisfied: prettytable<1 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython>=1.0 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: pickleshare in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: matplotlib-inline in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: jedi>=0.16 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: traitlets>=4.2 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: decorator in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: pygments in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: backcall in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\ram charan reddy\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\ram charan reddy\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\ram charan reddy\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

In [11]:
%load_ext sql

In [12]:
import csv, sqlite3
con = sqlite3.connect("test.db")
cur = con.cursor()

In [13]:
%sql sqlite:///test.db

In [14]:
#With above a connection is now established to test.db and we can directly write a query with %%sql magic command using above
#Note: The %%sql command is a Jupyter Notebook magic command that allows you to execute SQL queries directly in a notebook cell. Provided that database connection is established

#Below are DDL Commands executed with %%sql magic command
#CREATE: The CREATE command is used to create a new database object, such as a table, index, or view. For example, to create a new table called "users" with columns for a user's name, email, and password, you would use the following SQL statement:

In [15]:
%%sql
CREATE TABLE if not exists users
(id INT PRIMARY KEY,
name VARCHAR(50) NOT NULL,
email VARCHAR(50) NOT NULL,
password VARCHAR(50) NOT NULL);

 * sqlite:///test.db
Done.

[]

In [16]:
#2)DROP: The DROP command is used to delete an existing database object. For example, to delete the "users" table created in the previous example, you would use the following SQL statement:

In [17]:
# DROP example to delete tables
%sql DROP TABLE users;

 * sqlite:///test.db
Done.

[]

In [18]:
%sql SELECT * FROM users
#Below output shows that users table is deleted (no such table: users)

 * sqlite:///test.db
(sqlite3.OperationalError) no such table: users
[SQL: SELECT * FROM users]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [19]:
#3)ALTER: The ALTER command is used to modify an existing database object, such as a table, index, or view. For example, to add a new column to the "users" table to track a user's login status.

In [20]:
%%sql
CREATE TABLE if not exists users
(id INT PRIMARY KEY,
name VARCHAR(50) NOT NULL,
email VARCHAR(50) NOT NULL,
password VARCHAR(50) NOT NULL);

 * sqlite:///test.db
Done.

[]

In [21]:
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

In [22]:
# ALTER Example to change column name and schema
%sql ALTER TABLE users ADD COLUMN login_status BOOLEAN;

 * sqlite:///test.db
Done.

[]

In [23]:

%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

In [24]:
#4)TRUNCATE: The TRUNCATE command is used to delete all the rows in a table, while keeping the table structure intact. For example, to delete all the data in the "users" table but keep the table structure, you would use the following SQL statement:
#*Please note that SQLite has command : DELETE FROM table_name* instead of TRUNCATE from mySQL

#Command in my SQL is as below:
#TRUNCATE TABLE table_name

In [25]:

%sql select * from users;

 * sqlite:///test.db
Done.

[]

In [26]:
%%sql 
INSERT INTO users VALUES (1,'Jane Doe','test@test.com','123#413s',False);
INSERT INTO users VALUES (2, 'Jane Doe','test@jane.com','21wdds2',True);

 * sqlite:///test.db
1 rows affected.
1 rows affected.

[]

In [27]:
# Truncate Example SQLITE Has DELETE command instead of TRUNCATE
%sql DELETE FROM users;

 * sqlite:///test.db
2 rows affected.

[]

In [28]:
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

In [29]:
# Question 3: What is DML? Explain INSERT, UPDATE, and DELETE with an example.
# Answer : DML stands for "Data Manipulation Language," and it is a subset of SQL (Structured Query Language) that is used to manipulate data within a database. The three main commands in DML are INSERT, UPDATE, and DELETE.
# Creating a Blank Table first with student information grades

In [30]:
%%sql
CREATE TABLE if not exists students
(name VARCHAR(50) ,
age INT ,
grade VARCHAR(2));

 * sqlite:///test.db
Done.

[]

In [31]:
# Viewing the students table
%sql SELECT * FROM students

 * sqlite:///test.db
Done.

[('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C')]

In [32]:
#1)INSERT - The INSERT command is used to add new data to a database table.

In [33]:
#INSERT Command
%sql INSERT INTO students VALUES ('ram charan', 28, 'B');

 * sqlite:///test.db
1 rows affected.

[]

In [34]:
# Viewing the table now
%sql SELECT * FROM students

 * sqlite:///test.db
Done.

[('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C'),
 ('ram charan', 28, 'B')]

In [35]:
#2)UPDATE: The UPDATE command is used to modify existing data in a database table

In [36]:
# UPDATE example
%sql UPDATE students SET grade = 'A+' WHERE name = 'Utkarsh Gaikwad';

 * sqlite:///test.db
0 rows affected.

[]

In [37]:
#View Updated table
%sql SELECT * FROM students;

 * sqlite:///test.db
Done.

[('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C'),
 ('ram charan', 28, 'B')]

In [38]:
#3)DELETE: The DELETE command is used to remove data from a database table.DELETE: The DELETE command is used to remove data from a database table.

In [39]:
%sql DELETE FROM students WHERE name='Utkarsh Gaikwad';

 * sqlite:///test.db
0 rows affected.

[]

In [40]:
%sql SELECT * FROM students;

 * sqlite:///test.db
Done.

[('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C'),
 ('ram charan', 28, 'B')]

In [41]:
# Question 4: What is DQL? Explain SELECT with an example.
# Answer : DQL stands for "Data Query Language," and it is a subset of SQL (Structured Query Language) that is used to retrieve data from a database. The main command in DQL is SELECT.

In [42]:
%sql SELECt * FROM students

 * sqlite:///test.db
Done.

[('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C'),
 ('ram charan', 28, 'B')]

In [43]:
%%sql
INSERT INTO students VALUES ('Utkarsh', 28, 'A');
INSERT INTO students VALUES ('John', 35, 'B');
INSERT INTO students VALUES ('Krish', 40, 'A');
INSERT INTO students VALUES ('Sudh', 35, 'A');
INSERT INTO students VALUES ('Jane', 24, 'C');
INSERT INTO students VALUES ('Aditi', 22, 'B');
INSERT INTO students VALUES ('Kritika', 38, 'C')

 * sqlite:///test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [44]:
# Selecting Entire students table
%sql SELECT * from students;

 * sqlite:///test.db
Done.

[('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C'),
 ('ram charan', 28, 'B'),
 ('Utkarsh', 28, 'A'),
 ('John', 35, 'B'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Jane', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C')]

In [45]:
# Example 2 : Show only name and age of students
%sql SELECT name, age FROM students;

 * sqlite:///test.db
Done.

[('ram charan', 28),
 ('Utkarsh', 28),
 ('John', 35),
 ('Krish', 40),
 ('Sudh', 35),
 ('Jane', 24),
 ('Aditi', 22),
 ('Kritika', 38),
 ('ram charan', 28),
 ('Utkarsh', 28),
 ('John', 35),
 ('Krish', 40),
 ('Sudh', 35),
 ('Jane', 24),
 ('Aditi', 22),
 ('Kritika', 38)]

In [46]:
# Example 3: Selecting student with A Grade
%sql SELECT * FROM students WHERE grade='A';

 * sqlite:///test.db
Done.

[('Utkarsh', 28, 'A'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A'),
 ('Utkarsh', 28, 'A'),
 ('Krish', 40, 'A'),
 ('Sudh', 35, 'A')]

In [47]:
# Question 5: Explain Primary Key and Foreign Key.
# Answer:
# Primary Key: In a database table, a primary key is a column or a set of columns that uniquely identifies each row in the table. The primary key is used to ensure that each row in the table is unique, and it is often used as a reference by other tables. The primary key is also used to enforce data integrity, which means that it ensures that there are no duplicate or null values in the key column(s).
# Creating a table named "customers" with columns "customer_id", "first_name", "last_name", and "email". The "customer_id" column is defined as the primary key.

In [48]:
%%sql
CREATE TABLE customers (
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  email VARCHAR(100));

 * sqlite:///test.db
(sqlite3.OperationalError) table customers already exists
[SQL: CREATE TABLE customers (
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  email VARCHAR(100));]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [49]:
%sql SELECT * FROM customers

 * sqlite:///test.db
Done.

[]

In [50]:
#2) Foreign Key: A foreign key is a column or a set of columns in a table that refers to the primary key of another table. The foreign key is used to establish a relationship between two tables, and it ensures that the data in the foreign key column(s) of one table matches the data in the primary key column(s) of the other table.

# Creating a table named "orders" with columns "order_id", "order_date", "customer_id", and "total_amount". The "order_id" column is defined as the primary key, and the "customer_id" column is defined as a foreign key that references the "customer_id" column of the "customers" table. This establishes a relationship between the "orders" table and the "customers" table. The "total_amount" column is used to store the total amount of the order.

In [51]:
%%sql
CREATE TABLE orders (
  order_id INT PRIMARY KEY,
  order_date DATE,
  customer_id INT,
  total_amount DECIMAL(10,2),
  FOREIGN KEY (customer_id) REFERENCES customers(customer_id));

 * sqlite:///test.db
(sqlite3.OperationalError) table orders already exists
[SQL: CREATE TABLE orders (
  order_id INT PRIMARY KEY,
  order_date DATE,
  customer_id INT,
  total_amount DECIMAL(10,2),
  FOREIGN KEY (customer_id) REFERENCES customers(customer_id));]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [52]:
%sql SELECT * FROM orders

 * sqlite:///test.db
Done.

[]

In [53]:
con.close()

In [54]:
#Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method

In [55]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\ram charan reddy\anaconda3\lib\site-packages (8.3.0)

In [58]:
import mysql.connector

# Establish the connection
connection = mysql.connector.connect(
    host="local_host",
    user="abcd",
    password="ramc53112@",
   
)

# Create a cursor object
cursor = connection.cursor()

# Example: Execute a simple query
query = "SELECT * FROM your_table"
cursor.execute(query)

# Fetch the result
result = cursor.fetchall()

# Process the result
for row in result:
    print(row)

# Close the cursor and connection
cursor.close()
connection.close()

DatabaseError: 2005 (HY000): Unknown MySQL server host 'local_host' (11001)

In [ ]:
# 1)In above code, we first establish a connection to a MySQL database using the mysql.connector.connect() method, which takes the host, user, password as arguments.
# 2)Next, we create a cursor object using the cursor() method of the connection object. The cursor object allows us to execute queries and fetch results.
# 3)We then execute a SQL query using the execute() method of the cursor object, which takes the SQL query as an argument.

In [ ]:
# 7)Question : Give the order of execution of SQL clauses in an SQL query.

#  Answer:

#In an SQL query, the clauses are executed in the following order:

# FROM clause: Specifies the table or tables from which to retrieve data.

# JOIN clause: Specifies how to join multiple tables together, if needed.

# WHERE clause: Specifies which rows to retrieve based on a set of conditions.

# GROUP BY clause: Specifies how to group rows based on one or more columns.

# HAVING clause: Specifies which groups to retrieve based on a set of conditions.

# SELECT clause: Specifies which columns to retrieve.

# DISTINCT clause: Specifies to retrieve only distinct values of the specified columns.

# ORDER BY clause: Specifies how to sort the retrieved rows based on one or more columns.

# LIMIT clause: Specifies the maximum number of rows to retrieve.